Repository: JanWichelmann/ctf4e
Catalog: src/Ctf4e.Server/Resources/Controllers/AdminGroupsController.*.resx
Languages: de

# ShowEditGroupFormAsync:NotFound
source: This group does not exist.
de: Diese Gruppe existiert nicht.

# ShowEditGroupFormAsync:MissingParameter
source: No group specified.
de: Es wurde keine Gruppe angegeben.

# EditGroupAsync:InvalidInput
source: Invalid input.
de: Ungültige Eingabe.

# EditGroupAsync:Success
source: The group was updated successfully.
de: Die Gruppe wurde erfolgreich aktualisiert.

# EditGroupAsync:UnknownError
source: An error occured while updating the group. Check the log for more details.
de: Beim Aktualisieren der Gruppe ist ein Fehler aufgetreten. Weitere Details finden sich im Log.

# CreateGroupAsync:InvalidInput
source: Invalid input.
de: Ungültige Eingabe.

# CreateGroupAsync:UnknownError
source: An error occured while creating the group. Check the log for more details.
de: Beim Erstellen der Gruppe ist ein Fehler aufgetreten. Weitere Details finden sich im Log.

# DeleteGroupAsync:NotFound
source: This group does not exist.
de: Diese Gruppe existiert nicht.

# DeleteGroupAsync:UnknownError
source: An error occured while deleting the group. Check the log for more details.
de: Beim Löschen der Gruppe ist ein Fehler aufgetreten. Weitere Details finden sich im Log.

# CreateGroupAsync:Success
source: The group was created successfully.
de: Die Gruppe wurde erfolgreich erstellt.

# DeleteGroupAsync:Success
source: The group was deleted successfully.
de: Die Gruppe wurde erfolgreich gelöscht.

# DeleteGroupAsync:GroupNotEmpty
source: The group needs to be empty before it can be deleted.
de: Die Gruppe muss leer sein, bevor sie gelöscht werden kann.
