Repository: JanWichelmann/ctf4e
Catalog: src/Ctf4e.Server/Resources/Controllers/AdminUsersController.*.resx
Languages: de

# ShowEditUserFormAsync:NotFound
source: This user does not exist.
de: Dieser Benutzer existiert nicht.

# ShowEditUserFormAsync:MissingParameter
source: No user specified.
de: Es wurde kein Benutzer angegeben.

# EditUserAsync:InvalidInput
source: Invalid input.
de: Ungültige Eingabe.

# EditUserAsync:Success
source: The user was updated successfully.
de: Der Benutzer wurde erfolgreich aktualisiert.

# EditUserAsync:UnknownError
source: An error occured while updating the user. Check the log for more details.
de: Beim Aktualisieren des Benutzers ist ein Fehler aufgetreten. Weitere Details finden sich im Log.

# EditUserAsync:NotFound
source: This user does not exist.
de: Dieser Benutzer existiert nicht.

# ExportLabCredentialsAsync:UnknownError
source: An error occured while exporting the lab credentials.
de: Beim Exportieren der Zugangsdaten ist ein Fehler aufgetreten

# ImportLabCredentialsAsync:UnknownError
source: An error occured while importing lab credentials.
de: Beim Importieren der Zugangsdaten ist ein Fehler aufgetreten

# ImportLabCredentialsAsync:InvalidFormat
source: Invalid line format. Note that each line must be user ID / lab user name / lab password separated by tabs.
de: Ungültiges Zeilenformat. Jede Zeile muss aus User ID / Praktikumsbenutzer / Praktikumspasswort bestehen, durch Tabs separiert.

# ImportLabCredentialsAsync:InvalidUserId
source: The user #{0} does not exist.
de: Der Benutzer #{0} existiert nicht.

# ImportLabCredentialsAsync:NoFile
source: Please upload a CSV file with the lab credentials to import.
de: Bitte lade eine CSV-Datei mit Praktikumszugangsdaten hoch.

# ImportLabCredentialsAsync:Success
source: The lab credentials were imported successfully.
de: Die Zugangsdaten wurden erfolgreich importiert.
