Repository: JanWichelmann/ctf4e
Catalog: src/Ctf4e.Server/Resources/Controllers/AdminLabsController.*.resx
Languages: de

# ShowEditLabFormAsync:NotFound
source: This lab does not exist.
de: Dieses Praktikum existiert nicht.

# ShowEditLabFormAsync:MissingParameter
source: No lab specified.
de: Es wurde kein Praktikum angegeben.

# EditLabAsync:InvalidInput
source: Invalid input.
de: Ungültige Eingabe.

# EditLabAsync:Success
source: The lab was updated successfully.
de: Das Praktikum wurde erfolgreich aktualisiert.

# EditLabAsync:UnknownError
source: An error occured while updating the lab. Check the log for more details.
de: Beim Aktualisieren des Praktikums ist ein Fehler aufgetreten. Weitere Details finden sich im Log.

# CreateLabAsync:InvalidInput
source: Invalid input.
de: Ungültige Eingabe.

# CreateLabAsync:Success
source: The lab was created successfully.
de: Das Praktikum wurde erfolgreich erstellt.

# CreateLabAsync:UnknownError
source: An error occured while creating the lab. Check the log for more details.
de: Beim Erstellen des Praktikums ist ein Fehler aufgetreten. Weitere Details finden sich im Log.

# DeleteLabAsync:NotFound
source: This lab does not exist.
de: Dieses Praktikum existiert nicht.

# DeleteLabAsync:Success
source: The lab was deleted successfully.
de: Das Praktikum wurde erfolgreich gelöscht.

# DeleteLabAsync:UnknownError
source: An error occured while deleting the lab. Check the log for more details.
de: Beim Löschen des Praktikums ist ein Fehler aufgetreten. Weitere Details finden sich im Log.

# DeleteLabAsync:HasExecutions
source: The lab has at least one execution and thus cannot be deleted anymore.
de: Das Praktikum hat bereits einmal stattgefunden und kann somit nicht mehr gelöscht werden.

# EditLabAsync:NotFound
source: This lab does not exist.
de: Dieses Praktikum existiert nicht.
