Repository: JanWichelmann/ctf4e
Catalog: src/Ctf4e.Server/Resources/Controllers/AdminSlotsController.*.resx
Languages: de

# ShowEditSlotFormAsync:NotFound
source: This time slot does not exist.
de: Dieser Terminslot existiert nicht.

# ShowEditSlotFormAsync:MissingParameter
source: No slot specified.
de: Es wurde kein Terminslot angegeben.

# EditSlotAsync:InvalidInput
source: Invalid input.
de: Ungültige Eingabe.

# EditSlotAsync:Success
source: The slot was updated successfully.
de: Der Terminslot wurde erfolgreich aktualisiert.

# EditSlotAsync:UnknownError
source: An error occured while updating the time slot. Check the log for more details.
de: Beim Aktualisieren des Terminslots ist ein Fehler aufgetreten. Weitere Details finden sich im Log.

# CreateSlotAsync:InvalidInput
source: Invalid input.
de: Ungültige Eingabe.

# CreateSlotAsync:Success
source: The time slot was created successfully.
de: Der Terminslot wurde erfolgreich erstellt.

# CreateSlotAsync:UnknownError
source: An error occured while creating the time slot. Check the log for more details.
de: Beim Erstellen der Terminslots ist ein Fehler aufgetreten. Weitere Details finden sich im Log.

# DeleteSlotAsync:NotFound
source: This time slot does not exist.
de: Dieser Terminslot existiert nicht.

# DeleteSlotAsync:Success
source: The slot was deleted successfully.
de: Der Terminslot wurde erfolgreich gelöscht.

# DeleteSlotAsync:UnknownError
source: An error occured while deleting the time slot. Check the log for more details.
de: Beim Löschen des Terminslots ist ein Fehler aufgetreten. Weitere Details finden sich im Log.

# DeleteSlotAsync:HasGroups
source: The time slot must not have any groups.
de: Der Slot darf keine Gruppen enthalten.
