Repository: JanWichelmann/ctf4e
Catalog: src/Ctf4e.Server/Resources/Controllers/AdminScoreboardController.*.resx
Languages: de

# DeleteExerciseSubmissionAsync:Success
source: The exercise submission was deleted successfully.
de: Die Aufgabeneinreichung wurde erfolgreich gelöscht.

# DeleteExerciseSubmissionAsync:UnknownError
source: An error occured when deleting the exercise submission. Check the log for more details.
de: Beim Löschen der Aufgabeneinreichung ist ein Fehler aufgetreten. Weitere Details finden sich im Log.

# DeleteExerciseSubmissionsAsync:Success
source: The exercise submissions were deleted successfully.
de: Die Aufgabeneinreichungen wurden erfolgreich gelöscht.

# DeleteExerciseSubmissionsAsync:UnknownError
source: An error occured when deleting the exercise submissions. Check the log for more details.
de: Beim Löschen der Aufgabeneinreichungen ist ein Fehler aufgetreten. Weitere Details finden sich im Log.

# CreateExerciseSubmissionAsync:Success
source: The exercise submission was created successfully.
de: Die Aufgabeneinreichung wurde erfolgreich erstellt.

# CreateExerciseSubmissionAsync:UnknownError
source: An error occured when creating the exercise submission. Check the log for more details.
de: Beim Erstellen der Aufgabeneinreichung ist ein Fehler aufgetreten. Weitere Details finden sich im Log.

# DeleteFlagSubmissionAsync:Success
source: The flag submission was deleted successfully.
de: Die Flageinreichung wurde erfolgreich gelöscht.

# DeleteFlagSubmissionAsync:UnknownError
source: An error occured when deleting the flag submission. Check the log for more details.
de: Beim Löschen der Flageinreichung ist ein Fehler aufgetreten. Weitere Details finden sich im Log.

# CreateFlagSubmissionAsync:Success
source: The flag submission was created successfully.
de: Die Flageinreichung wurde erfolgreich erstellt.

# CreateFlagSubmissionAsync:UnknownError
source: An error occured when creating the flag submission. Check the log for more details.
de: Beim Erstellen der Flageinreichung ist ein Fehler aufgetreten. Weitere Details finden sich im Log.

# UploadToMoodleAsync:Success
source: The Moodle upload was completed successfully.
de: Der Moodle-Upload wurde erfolgreich durchgeführt.

# UploadToMoodleAsync:UnknownError
source: An error occured when collecting and uploading the data. Check the log for more details.
de: Beim Sammeln und Hochladen der Daten ist ein Fehler aufgetreten. Weitere Details finden sich im Log.

# DownloadAsCsvAsync:UnknownError
source: An error occured when generating the CSV file. Check the log for more details.
de: Beim Generieren der CSV-Datei ist ein Fehler aufgetreten. Weitere Details finden sich im Log.

# CallLabServerAsync:NotFound
source: This lab does not exist.
de: Dieses Praktikum existiert nicht.
