Repository: JanWichelmann/ctf4e
Catalog: src/Ctf4e.Server/Resources/Controllers/AdminLabExecutionsController.*.resx
Languages: de

# ShowEditLabExecutionFormAsync:NotFound
source: This lab execution does not exist.
de: Diese Praktikumsausführung existiert nicht.

# ShowEditLabExecutionFormAsync:MissingParameter
source: No lab execution specified.
de: Es wurde keine Praktikumsausführung angegeben.

# EditLabExecutionAsync:InvalidInput
source: Invalid input.
de: Ungültige Eingabe.

# EditLabExecutionAsync:Success
source: The lab execution was updated successfully.
de: Die Praktikumsausführung wurde erfolgreich aktualisiert.

# EditLabExecutionAsync:UnknownError
source: An error occured while updating the lab execution. Check the log for more details.
de: Beim Aktualisieren der Praktikumsausführung ist ein Fehler aufgetreten. Weitere Details finden sich im Log.

# CreateMultipleLabExecutionsAsync:InvalidInput
source: Invalid input.
de: Ungültige Eingabe.

# CreateMultipleLabExecutionsAsync:Success
source: The lab execution was created successfully.
de: Die Praktikumsausführung(en) wurde(n) erfolgreich erstellt.

# CreateMultipleLabExecutionsAsync:UnknownError
source: An error occured when creating the lab execution(s). Check the log for more details.
de: Beim Erstellen der Praktikumsausführung ist ein Fehler aufgetreten. Weitere Details finden sich im Log.

# CreateLabExecutionAsync:InvalidInput
source: Invalid input.
de: Ungültige Eingabe.

# CreateLabExecutionAsync:Success
source: The lab execution was created successfully.
de: Die Praktikumsausführung wurde erfolgreich erstellt.

# DeleteLabExecutionAsync:NotFound
source: This lab execution does not exist.
de: Diese Praktikumsausführung existiert nicht.

# DeleteLabExecutionAsync:Success
source: The lab execution was deleted successfully.
de: Die Praktikumsausführung wurde erfolgreich gelöscht.

# DeleteLabExecutionAsync:UnknownError
source: An error occured while deleting the lab execution. Check the log for more details.
de: Beim Löschen der Praktikumsausführung ist ein Fehler aufgetreten. Weitere Details finden sich im Log.

# DeleteMultipleLabExecutionsAsync:Success
source: The lab execution was deleted successfully.
de: Die Praktikumsausführung(en) wurde(n) erfolgreich gelöscht.

# DeleteMultipleLabExecutionsAsync:UnknownError
source: An error occured while deleting the lab execution(s). Check the log for more details.
de: Beim Löschen der Praktikumsausführung(en) ist ein Fehler aufgetreten. Weitere Details finden sich im Log.

# CreateLabExecutionAsync:UnknownError
source: An error occured while creating the lab execution. Maybe there is already a lab execution for the given group? Check the log for more details.
de: Beim Erstellen der Praktikumsausführung ist ein Fehler aufgetreten. Existiert bereits eine Praktikumsausführung für diese Gruppe und dieses Praktikum? Weitere Details finden sich im Log.

# ShowEditLabExecutionFormAsync:Warning
source: Note: Editing an active lab execution may lead to changes of the "passed" status and shifts in the scoreboard. Exercise and flag submissions won't be deleted, even if they would not be possible within the new beginning and end times.
de: Achtung: Das Bearbeiten einer bereits aktiven Praktikumsausführung kann zu Änderungen des "Bestanden"-Status und Verschiebungen im Scoreboard führen. Aufgaben- und Flag-Einreichungen werden nicht gelöscht, auch wenn diese bezüglich der neuen Beginn- und Endzeiten nicht möglich gewesen wären.

# CreateMultipleLabExecutionsAsync:ErrorGroup
source: Could not start lab for group #{0} ({1}). Is there already a lab execution for the given group?
de: Konnte Praktikum für Gruppe #{0} ({1}) nicht starten. Ist es für diese Gruppe bereits gestartet?

# EditLabExecutionAsync:NotFound
source: This lab execution do
de: Diese Praktikumsausführung existiert nicht.
