Repository: JanWichelmann/ctf4e
Catalog: src/Ctf4e.Server/Resources/Controllers/AdminExercisesController.*.resx
Languages: de

# EditExerciseAsync:InvalidInput
source: Invalid input.
de: Ungültige Eingabe.

# CreateExerciseAsync:InvalidInput
source: Invalid input.
de: Ungültige Eingabe.

# EditExerciseAsync:Success
source: The exercise was updated successfully.
de: Die Aufgabe wurde erfolgreich aktualisiert.

# CreateExerciseAsync:Success
source: The exercise was created successfully.
de: Die Aufgabe wurde erfolgreich erstellt.

# CreateExerciseAsync:UnknownError
source: An error occured while creating the exercise. Check the log for more details.
de: Beim Erstellen der Aufgabe ist ein Fehler aufgetreten. Weitere Details finden sich im Log.

# DeleteExerciseAsync:UnknownError
source: An error occured while deleting the exercise. Check the log for more details.
de: Beim Löschen der Aufgabe ist ein Fehler aufgetreten. Weitere Details finden sich im Log.

# DeleteExerciseAsync:Success
source: The exercise was deleted successfully.
de: Die Aufgabe wurde erfolgreich gelöscht.

# EditExerciseAsync:UnknownError
source: An error occured while updating the exercise. Check the log for more details.
de: Beim Aktualisieren der Aufgabe ist ein Fehler aufgetreten. Weitere Details finden sich im Log.

# ShowEditExerciseFormAsync:NotFound
source: This exercise does not exist.
de: Diese Aufgabe existiert nicht.

# EditExerciseAsync:NotFound
source: This exercise does not exist.
de: Diese Aufgabe existiert nicht.

# DeleteExerciseAsync:NotFound
source: This exercise does not exist.
de: Diese Aufgabe existiert nicht.
