Repository: JanWichelmann/ctf4e
Catalog: src/Ctf4e.Server/Resources/Controllers/AuthenticationController.*.resx
Languages: de

# DevLoginAsync:NotFound
source: This user does not exist.
de: Dieser Benutzer existiert nicht.

# DevLoginAsync:Success
source: Login successful.
de: Login erfolgreich.

# AdminLoginAsUserAsync:NotFound
source: This user does not exist.
de: Dieser Benutzer existiert nicht.

# LogoutAsync:Success
source: Logout successful.
de: Logout erfolgreich.

# HandleGroupSelectionAsync:InvalidInput
source: Invalid input.
de: Ungültige Eingabe.

# HandleGroupSelectionAsync:Success
source: The group was created successfully.
de: Die Gruppe wurde erfolgreich erstellt.

# AdminLoginAsUserAsync:Success
source: Login as {0} successful.
de: Login als {0} erfolgreich.

# HandleGroupSelectionAsync:TooFewCodes
source: You entered too few codes. The minimum group size is {0}.
de: Es wurden zu wenig Codes eingegeben. Die minimale Gruppengröße beträgt {0}.

# HandleGroupSelectionAsync:TooManyCodes
source: You entered too many codes. The maximum group size is {0}.
de: Es wurden zu viele Codes eingegeben. Die maximale Gruppengröße beträgt {0}.

# HandleGroupSelectionAsync:CodeAlreadyAssigned
source: At least one of the entered codes is already assigned to a group.
de: Mindestens ein eingegebener Code ist bereits einer Gruppe zugewiesen.

# HandleGroupSelectionAsync:UnknownError
source: An error has occured.
de: Ein Fehler ist aufgetreten.

# LoginMoodleAsync:InvalidLogin
source: Invalid login.
de: Ungültiger Login.

# LoginMoodleAsync:AccountCreationSuccess
source: The user account was created successfully.
de: Der Benutzeraccount wurde erfolgreich erstellt.

# LoginMoodleAsync:Success
source: Login successful.
de: Login erfolgreich.

# ChangeSettingsAsync:PasswordsDoNotMatch
source: The new passwords do not match.
de: Die beiden Angaben für das neue Passwort stimmen nicht überein.

# ChangeSettingsAsync:Success
source: Updating settings successful.
de: Aktualisieren der Einstellungen erfolgreich.

# ChangeSettingsAsync:WrongOldPassword
source: The old password is incorrect.
de: Das angegebene alte Passwort ist falsch.

# ChangeSettingsAsync:WrongPasswordFormat
source: The new password must be non-empty and at least 8 characters long.
de: Das neue Passwort muss mindestens 8 Zeichen lang sein.

# PasswordLoginAsync:RateLimited
source: Allowed number of login attempts exceeded. Please wait for a few minutes, or try to login via Moodle.
de: Die Anzahl der erlaubten Login-Versuche wurde überschritten. Bitte warten Sie einige Minuten, oder nutzen Sie den Moodle-basierten Login.

# PasswordLoginAsync:Success
source: Login successful.
de: Login erfolgreich.

# PasswordLoginAsync:WrongPassword
source: This username/password combination is invalid.
de: Diese Kombination aus Benutzername und Passwort ist ungültig.
