Repository: JanWichelmann/ctf4e
Catalog: src/Ctf4e.LabServer/Resources/Views/Group.*.resx
Languages: de

# HtmlTitle
source: Submit solutions
de: Lösungen einreichen

# Title
source: Submit solutions
de: Lösungen einreichen

# Exercises:Solved
source: Exercise solved
de: Aufgabe gelöst

# Exercises:SolvedByGroupMemberAndPassed
source: Exercise solved by group member (sufficient for passing the lab)
de: Aufgabe von Gruppenmitglied gelöst (genügt zum Bestehen)

# Exercises:SolvedByGroupMemberAndNotPassed
source: Exercise solved by group member (still needs to be solved by you)
de: Aufgabe von Gruppenmitglied gelöst (muss noch selbst gelöst werden)

# Exercises:Pending
source: Exercise pending
de: Aufgabe ausstehend

# Exercises:TitleIsLink
source: The exercise title is a link
de: Der Aufgabentitel ist ein Link

# Exercises:Admin:Pass:Text
source: (Admin) Mark as solved
de: (Admin) Als gelöst markieren

# Exercises:Admin:Reset:Text
source: (Admin) Reset
de: (Admin) Zurücksetzen

# Exercises:Admin:Pass
source: Pass
de: Bestehen

# Exercises:Admin:Reset
source: Reset
de: Zurücksetzen

# Exercises:Form:Input:Placeholder
source: Insert solution
de: Lösung eingeben

# Exercises:Form:Submit
source: Check
de: Überprüfen

# Docker:Title
source: Credentials
de: Zugangsdaten

# Docker:Username
source: User name
de: Benutzername

source: Copy
de: Kopieren

# Docker:Password
source: Password
de: Passwort

# Log:InfoText
source: The log is limited to <strong>{0}</strong> entries.
de: Das Log ist auf <strong>{0}</strong> Einträge beschränkt.

# Log:Entries:Timestamp
source: Timestamp
de: Zeitstempel

# Log:Entries:Message
source: Message
de: Nachricht

# Modal:MarkExerciseSolved:Title
source: Mark exercise as solved
de: Aufgabe als gelöst markieren

# Modal:MarkExerciseSolved:Body
source: <p>Do you really want to mark the exercise <span class="font-weight-bold" data-replace="exercise-name"></span> as solved?</p><p>Note: This will trigger a message to the CTF system.</p>
de: <p>Soll die Aufgabe <span class="font-weight-bold" data-replace="exercise-name"></span> wirklich als gelöst markiert werden?</p><p>Hinweis: Dies löst ebenfalls eine Benachrichtigung an das CTF-System aus.</p>

source: Cancel
de: Abbrechen

# Modal:MarkExerciseSolved:Submit
source: Mark as solved
de: Als gelöst markieren

# Modal:ResetExercise:Title
source: Reset exercise
de: Aufgabe zurücksetzen

# Modal:ResetExercise:Body
source: <p>Do you really want to reset the exercise <span class="font-weight-bold" data-replace="exercise-name"></span>?</p><p>Note: This only resets the exercise state on this server; existing submissions in the CTF system will remain untouched and need to be deleted manually.</p>
de: <p>Soll die Aufgabe <span class="font-weight-bold" data-replace="exercise-name"></span> wirklich zurückgesetzt werden?</p><p>Hinweis: Dies setzt lediglich den Status der Aufgabe auf diesem Server zurück; existierende Einreichungen im CTF-System bleiben unberührt und müssen manuell gelöscht werden.</p>

# Modal:ResetExercise:Submit
source: Reset
de: Zurücksetzen
