Repository: JanWichelmann/ctf4e
Catalog: src/Ctf4e.Server/Resources/Views/Admin/Users/Index.*.resx
Languages: de

# HtmlTitle
source: Manage users
de: Benutzer verwalten

# Title
source: Manage users
de: Benutzer verwalten

# Users:GroupCode
source: Group code
de: Gruppencode

# Users:GroupId
source: Group ID
de: Gruppe

source: Actions
de: Aktionen

# Users:EditGroup:Text
source: Edit group
de: Gruppe bearbeiten

# Users:IsTutor:Text
source: Is tutor and thus not shown in scoreboard
de: Ist Tutor und wird daher nicht im Scoreboard angezeigt

source: Edit
de: Bearbeiten

# Users:Privileges:Admin
source: Admin permissions
de: Adminrechte

# Users:Privileges:EditUsers
source: Edit users
de: Benutzer bearbeiten

# Users:Privileges:ViewUsers
source: View users
de: Benutzer einsehen

# Users:Privileges:EditAdminScoreboard
source: Edit admin scoreboard
de: Admin-Scoreboard bearbeiten

# Users:Privileges:ViewAdminScoreboard
source: View admin scoreboard
de: Admin-Scoreboard einsehen

# Users:Privileges:EditConfiguration
source: Edit configuration
de: Konfiguration bearbeiten

# Users:Privileges:EditGroups
source: Edit groups
de: Gruppen bearbeiten

# Users:Privileges:EditLabExecutions
source: Edit lab executions
de: Aktive Praktika bearbeiten

# Users:Privileges:EditLabs
source: Edit labs/exercises/flags
de: Praktika/Aufgaben/Flags bearbeiten

# Users:Privileges:ViewLabs
source: View labs/exercises/flags
de: Praktika/Aufgaben/Flags einsehen

# Users:Privileges:EditSlots
source: Edit time slots
de: Terminslots bearbeiten

# Users:Privileges:ViewSlots
source: View slots
de: Terminslots einsehen

# Users:Privileges:ViewLabExecutions
source: View lab executions
de: Aktive Praktika einsehen

# Users:Privileges:ViewGroups
source: View groups
de: Gruppen einsehen

# Users:Privileges:LoginAsLabServerAdmin
source: Admin permissions for lab servers (via admin scoreboard)
de: Admin-Zugriff auf Praktikumsserver (via Admin-Scoreboard)

# Users:Privileges:TransferResults
source: Synchronize/import/export results
de: Ergebnisse synchronisieren/importieren/exportieren

# Users:Privileges
source: Permissions
de: Zugriffsrechte

# Users:LabCredentials
source: Lab credentials
de: Zugangsdaten

# Users:LabPasswordPresent
source: Lab container password set
de: Passwort für Praktikumscontainer gesetzt

source: Export lab credentials
de: Praktikumszugangsdaten exportieren

source: Import lab credentials
de: Praktikumszugangsdaten importieren

# ManageLabCredentials
source: Lab credentials
de: Praktikumszugangsdaten

# ManageLabCredentials:Text
source: Here you can import and export lab credentials. Both actions use a CSV-based file format: <code>User ID \t Lab username \t Lab password</code>
de: Hier können Praktikumszugangsdaten importiert und exportiert werden. Beide Aktionen verwenden ein CSV-basiertes Dateiformat: <code>User ID \t Benutzername \t Passwort</code>
