Repository: JanWichelmann/ctf4e
Catalog: src/Ctf4e.Server/Resources/Views/AdminLabExecutions.List.*.resx
Languages: de

source: Actions
de: Aktionen

source: Cancel
de: Abbrechen

source: Delete
de: Löschen

source: Edit
de: Bearbeiten

# Title
source: Manage lab executions
de: Aktive Praktika verwalten

# Explanation
source: <p> Lab executions control when a lab starts and ends. The following rules apply: </p> <ul> <li><strong>Begin:</strong> All exercises can be solved and all flags can be submitted. Participants can pass the lab.</li> <li><strong>End:</strong> Participants can still solve exercises and submit flags, but those no longer influence the grade or the scoreboard.</li> </ul> <p> The given dates need to always be in the given order and must not be identical. </p>
de: <p> Praktikumsausführungen steuern, wann ein Praktikumstermin startet und endet. Hierfür gibt es folgende Regeln: </p> <ul> <li><strong>Vorbereitungsphase:</strong> Ab diesem Zeitpunkt können bestimmte Aufgaben bearbeitet und sämtliche Flags eingelöst werden.</li> <li><strong>Beginn:</strong> Ab diesem Zeitpunkt sind sämtliche Aufgaben freigeschaltet. Die Gruppen können in diesem Zeitraum das Praktikum bestehen.</li> <li><strong>Ende:</strong> Nach diesem Zeitpunkt können zwar noch Aufgaben bearbeitet werden, diese werden jedoch nicht mehr im Scoreboard gewertet. Flags können nicht mehr eingelöst werden.</li> </ul> <p> Die einzelnen Zeitpunkte müssen immer die gegebene Reihenfolge (Vor-Beginn, Beginn, Ende) haben und dürfen nicht exakt gleich sein. </p>

# StartForOneGroup
source: Start lab for one group
de: Praktikum für eine Gruppe starten

# StartForSlot
source: Start lab for all groups of a time slot
de: Praktikum für alle Gruppen eines Termins starten / anpassen

# StopForSlot
source: Stop lab for all groups of a time slot
de: Praktikum für alle Gruppen eines Termins abbrechen

# LabExecutions:Group
source: Group
de: Gruppe

# LabExecutions:Lab
source: Lab
de: Praktikum

# LabExecutions:Begin
source: Begin
de: Beginn

# LabExecutions:End
source: End
de: Ende

# Modal:DeleteLabExecutionGroup:Title
source: Delete lab execution for group
de: Ausführung für Gruppe löschen

# Modal:DeleteLabExecutionGroup:Body
source: <p>Do you really want to delete the execution of lab &quot;<span data-replace="lab-name"></span>&quot; for group &quot;<span data-replace="group-name"></span>&quot;?</p><p>The group will no longer be able to submit exercises and flags, and existing submissions will be ignored.</p>
de: <p>Wollen Sie die Ausführung des Praktikums &quot;<span data-replace="lab-name"></span>&quot; für Gruppe &quot;<span data-replace="group-name"></span>&quot; wirklich löschen?</p><p>Die Gruppe kann dann keine Aufgaben mehr bearbeiten, und sämtliche existierenden Einreichungen werden nicht mehr gewertet.</p>

# Modal:DeleteLabExecutionGroup:Submit
source: Delete lab execution
de: Ausführung löschen

# Modal:DeleteLabExecutionsSlot:Title
source: Delete all lab executions for time slot
de: Alle Ausführungen für Terminslot löschen

# Modal:DeleteLabExecutionsSlot:Body
source: <p>Note: The groups will no longer be able to submit exercises, and all existing submissions will be ignored.</p>
de: <p>Hinweis: Die betroffenen Gruppen können dann keine Aufgaben mehr bearbeiten, und der &quot;Bestanden&quot;-Status wird zurückgesetzt.</p>

# Modal:DeleteLabExecutionsSlot:Form:Lab
source: Lab
de: Praktikum

# Modal:DeleteLabExecutionsSlot:Form:Lab:Placeholder
source: Select lab
de: Praktikum auswählen

# Modal:DeleteLabExecutionsSlot:Form:Slot
source: Time slot
de: Terminslot

# Modal:DeleteLabExecutionsSlot:Form:Slot:Placeholder
source: Select time slot
de: Slot auswählen

# Modal:DeleteLabExecutionsSlot:Submit
source: Delete lab executions
de: Ausführungen löschen

# LabExecutions:Group:Filter
source: Filter (regex)
de: Filtern (regex)

# LabExecutions:Lab:Filter
source: Filter (regex)
de: Filtern (regex)
