Repository: JanWichelmann/ctf4e
Catalog: src/Ctf4e.Server/Resources/Views/Authentication.Login.*.resx
Languages: de

# DevLogin:Submit
source: Login
de: Anmelden

# DevLogin:Title
source: Developer login
de: Entwickler-Login

# DevLogin:UserId
source: Select user
de: Benutzer ausw√§hlen

# PasswordLogin:Password
source: Password
de: Passwort

# PasswordLogin:Submit
source: Login
de: Anmelden

# PasswordLogin:Title
source: Login via Password
de: Passwort-Login

# PasswordLogin:Username
source: User name
de: Benutzername

# Tab:DevLogin
source: Developer
de: Entwickler

# Tab:PasswordLogin
source: Password
de: Passwort

# MoodleLogin:Title
source: Login via Moodle
de: Moodle-Login

# MoodleLogin:Button
source: Go to Moodle course
de: Zum Moodlekurs
