Repository: JanWichelmann/ctf4e
Catalog: src/Ctf4e.Server/Resources/Views/Authentication.GroupSelection.*.resx
Languages: de

# Title
source: Create group
de: Gruppe gründen

# YourCode
source: Your code: <span class="fw-bold font-monospace">{0}</span>
de: Ihr Code lautet: <span class="fw-bold font-monospace">{0}</span>

# Form:OtherUserCodes
source: Codes of your group partners
de: Codes Ihrer Gruppenpartner/Gruppenpartnerinnen

# Form:OtherUserCodes:Description
source: One code per line.
de: Ein Code pro Zeile.

# Form:SlotId
source: Time slot
de: Praktikumstermin

# Form:SlotId:Description
source: This must match the time slot which has been assigned to you.
de: Der Wert dieses Felds muss mit dem Ihnen während der Terminwahl zugewiesenen Termin übereinstimmen.

# Form:DisplayName
source: Group name
de: Name Ihrer Gruppe

# Form:DisplayName:Description
source: This field has full Unicode support, so apart from the length limitation there are no limits to your creativity. Afterwards, the group name cannot be changed anymore.
de: Dieses Feld hat volle Unicode-Unterstützung, Ihrer Kreativität sind abgesehen von der Längenbeschränkung also keine Grenzen gesetzt. Der Gruppenname kann anschließend nicht mehr geändert werden.

# Form:ShowInScoreboard
source: Participate in CTF and show group in scoreboard
de: Am CTF teilnehmen und Gruppe im Scoreboard anzeigen

# Form:ShowInScoreboard:Description
source: If you check this field, you participate on the course's Capture-The-Flag competition, and the name of your group will be shown in the scoreboard. Participation in the CTF is optional and has no disadvantages. The scoreboard only shows the top scores.
de: Mit Setzen dieses Feldes nehmen Sie am Praktikums-internen Capture-The-Flag teil, und Ihr Gruppenname wird im Scoreboard angezeigt. Die Teilnahme am CTF ist komplett freiwillig und hat keinerlei Nachteile. Das Scoreboard zeigt stets nur die oberen Plätze an.

# Form:FinalText
source: Done? Great! Please check all inputs once again. After the group was created, you will be logged out and need to login again. Then, you have access to your group dashboard.
de: Alles ausgefüllt? Super! Bitte überprüfen Sie sicherheitshalber nochmal alle Angaben. Anschließend klicken Sie auf "Gruppe erstellen". Das System wird dann eine neue Gruppe anlegen und Sie zum Arbeitsbereich Ihrer neuen Gruppe weiterleiten.

# Form:Submit
source: Create group
de: Gruppe erstellen
