Repository: JanWichelmann/ctf4e
Catalog: src/Ctf4e.Server/Resources/Views/Scoreboard.*.resx
Languages: de

# Title:ScoreboardAll
source: Scoreboard: All Labs
de: Scoreboard: Gesamtwertung über alle Praktika

# Title:ScoreboardLab
source: Lab Scoreboard: {0}
de: Praktikums-Scoreboard: {0}

# Scoreboard:Points
source: Points
de: Punkte

# Scoreboard:Group
source: Group
de: Gruppe

# Scoreboard:LastSubmission
source: Last submission: {0}
de: Letzte Einreichung: {0}

# Scoreboard:DetailedPoints
source: (Exercises: {0}, Flags: {1})
de: (Aufgaben: {0}, Flags: {1})

# Scoreboard:DetailedPointsWithBugs
source: (Exercises: {0}, Flags: {1}, Bugs: {2})
de: (Aufgaben: {0}, Flags: {1}, Bugs: {2})

# Scoreboard:GotBugBounty
source: This group got a bug bounty.
de: Diese Gruppe hat eine Bug-Bounty erhalten.

source: Select scoreboard
de: Scoreboard auswählen

source: All labs
de: Gesamtwertung über alle Praktika

source: Show all entries
de: Alle Einträge anzeigen

# TutorsAndAdminsOnly
source: For tutors and admins only
de: Nur für Tutoren und Administratoren

# AdminsOnly
source: For admins only
de: Nur für Administratoren

# ResetCache
source: Invalidate cache and reload from database
de: Cache umgehen und Scoreboard vollständig aus der Datenbank laden

# AutoReload
source: Automatically reload after (seconds)
de: Automatisch neu laden nach (Sekunden)

source: Show selected scoreboard
de: Gewähltes Scoreboard anzeigen

# SelectSlot
source: Select time slot
de: Terminslot auswählen

# AllSlots
source: (all)
de: (alle)

# Title:AllSlots
source: All time slots
de: Alle Terminslots

# Title:Slot
source: Time slot: {0}
de: Terminslot: {0}
