Repository: JanWichelmann/ctf4e
Catalog: src/Ctf4e.Server/Resources/Views/UserDashboard.*.resx
Languages: de

source: Lab
de: Praktikum

source: Passed
de: Bestanden

# LabExecutionStatus:Undefined:Title
source: Not enabled
de: Nicht freigeschaltet

# LabExecutionStatus:Undefined:Text
source: This lab is not yet enabled. You can neither work on exercises nor submit flags.
de: Dieses Praktikum ist bisher nicht freigeschaltet worden. Es können weder Aufgaben bearbeitet noch Flags eingelöst werden.

# LabExecutionStatus:BeforePreStart:Title
source: Waiting for start
de: Noch nicht gestartet

# LabExecutionStatus:BeforePreStart:Text
source: This lab has not yet started. You can neither work on exercises nor submit flags.<br>The lab is scheduled to start at <strong>{0:g}</strong>.
de: Dieses Praktikum hat noch nicht begonnen. Es können weder Aufgaben bearbeitet noch Flags eingelöst werden.<br>Startzeitpunkt: <strong>{0:g}</strong>

# LabExecutionStatus:PreStart:Title
source: Preparatory phase
de: Vorbereitungsphase

# LabExecutionStatus:PreStart:Text
source: This lab is in the preparatory phase. You can work on certain selected exercises and submit all flags.<br>Begin of main working time: <strong>{0:g}</strong>.
de: Dieses Praktikum ist in der Vorbereitungsphase. Es können einige ausgewählte Aufgaben bearbeitet und alle Flags eingelöst werden.<br>Beginn der Haupt-Bearbeitungsphase: <strong>{0:g}</strong>

# LabExecutionStatus:Start:Title
source: Active
de: Aktiv

# LabExecutionStatus:Start:Text
source: This lab is active. You can work on all exercises and submit all flags.<br>End of working time: <strong>{0:g}</strong>.
de: Dieses Praktikum ist aktiv. Es können alle Aufgaben bearbeitet und alle Flags eingelöst werden.<br>Ende des Praktikums: <strong>{0:g}</strong>

# LabExecutionStatus:End:Title
source: Ended
de: Beendet

# LabExecutionStatus:End:Text
source: This lab has ended. You can still work an exercises and submit flags; however, those won't be considered for grading and won't be reflected in the scoreboard.
de: Dieses Praktikum ist beendet. Es können weiterhin Aufgaben bearbeitet und Flags eingelöst werden; diese werden in der Wertung und auf dem Scoreboard jedoch nicht mehr berücksichtigt.

source: Lab server
de: Zum Praktikumsserver

source: Exercises
de: Aufgaben

source: Mandatory
de: Pflicht

# Exercises:SubmissionStatistic
source: Tries: {0} valid, {1} total
de: Versuche: {0} gültig, {1} insgesamt

source: Points
de: Punkte

source: Solved
de: Gelöst

source: NotSolved
de: Nicht gelöst

# ExerciseSubmissions:Timestamp
source: Submission time
de: Zeitpunkt des Lösungsversuchs

source: ExerciseSubmissions:Correct
de: Korrekte Lösung?

# ExerciseSubmissions:GroupMember
source: Group member
de: Gruppenmitglied

source: invalid
de: ungültig

# ExerciseSubmissions:Invalid
source: This solution attempt was submitted outside of the lab time.
de: Dieser Lösungsversuch fand außerhalb der vorgegebenen Praktikumszeit statt.

# Flags:SubmitFlag
source: Submit flag
de: Flag einlösen

# Flags:FoundFlags
source: Found flags
de: Gefundene Flags

# Flags:SubmissionStatistic
source: {0} valid, {1} total
de: {0} gültig, {1} insgesamt

# FlagSubmissions:Timestamp
source: Submission time
de: Einreichungszeitpunkt

# FlagSubmissions:GroupMember
source: Group member
de: Gruppenmitglied

# FlagSubmissions:Invalid
source: This flag was submitted outside of the lab time.
de: Diese Einreichung fand außerhalb der vorgegebenen Praktikumszeit statt.

# SwitchLab:Title
source: Switch lab
de: Zu anderem Praktikum wechseln

# SwitchLab:Active
source: active
de: aktiv

# SwitchLab:Submit
source: Go to selected lab
de: Zu ausgewähltem Praktikum wechseln
